УТ_для_edt/src/InformationRegisters/сфпДанныеКоллтрекинга/сфпДанныеКоллтрекинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>сфпДанныеКоллтрекинга</name>
  <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
  <resources>
    <name>ДатаЗвонка</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>utm_campaign</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_term</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_medium</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.CRM_Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>EnumRef.CRM_CallTrakingСценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_CallTrakingСценарии/CRM_CallTrakingСценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_CallTrakingСценарии</name>
  <enumValues>
    <name>Comagic</name>
  </enumValues>
  <enumValues>
    <name>ПочтовоеСообщение</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработка</name>
  </enumValues>
  <enumValues>
    <name>Calltouch</name>
  </enumValues>
  <enumValues>
    <name>Callibri</name>
  </enumValues>
  <enumValues>
    <name>Roistat</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийAPI</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>JivoSite</name>
  </enumValues>
  <enumValues>
    <name>UIS</name>
  </enumValues>
  <enumValues>
    <name>Mango</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/CRM_Заявка/CRM_Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Заявка</name>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UTMМетка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <comment>0 - Заявка, 1 - Звонок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартБизнесРегион</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>смартКвалификация</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСостояниеЛида</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>EnumRef.смартСостоянияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПродукт</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРезультатыПоискаПоКИ</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>смартБизнесРегионТекст</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТипТовара</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартYclid_Метка</name>
    <comment>//++ #1941 смарт: Фролов 22.07.2024 //Добавить реквизит &quot;yclid&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартClientID</name>
    <comment>#1958 смарт: Лопато 05.08.2024 //Добавить реквизит &quot;ClientID&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Catalogs/CRM_ПравилаОбработкиОбращений/CRM_ПравилаОбработкиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПравилаОбработкиОбращений</name>
  <attributes>
    <name>ОбращенияКлиентаОтветственному</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбращенияПКОтветственному</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресацияОбращения</name>
    <type>
      <types>EnumRef.CRM_ВариантыАдресацииОбращения</types>
    </type>
  </attributes>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбработки</name>
    <type>
      <types>EnumRef.CRM_ВариантыОбработкиОбращения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.CRM_ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОчередьОтветственных</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/HTTPServices/softphoneCalltracking/Module.bsl
Функция webhookGET(Запрос)
	
	ИмяСобытияДляЖурналаРегистрации = "/calltracking/webhook";
	
	ТекстОписание = "";
	ПараметрыСтрокой = "";
	Для Каждого ТекПараметр Из Запрос.ПараметрыЗапроса Цикл
		ПараметрыСтрокой = ПараметрыСтрокой + "&" + ТекПараметр.Ключ + "=" + ТекПараметр.Значение;
		ТекстОписание = ТекстОписание + ?(ТекстОписание = "", "", Символы.ПС) + ТекПараметр.Ключ + ": " + ТекПараметр.Значение;
	КонецЦикла;
	Если ЗначениеЗаполнено(ПараметрыСтрокой) Тогда
		сфпСофтФонПроСерверПереопределяемый.ЗаписатьЗапросВЖурналРегистрации(ИмяСобытияДляЖурналаРегистрации, ПараметрыСтрокой);
	КонецЕсли;	
	
	ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		сфпСофтФонПроСерверПереопределяемый.ЗаписатьЗапросВЖурналРегистрации(ИмяСобытияДляЖурналаРегистрации, ТелоЗапроса);
	КонецЕсли;	
	
	Если НЕ ПолучитьФункциональнуюОпцию("сфпИспользоватьCoMagic") Тогда
		Возврат СообщениеОбОшибке(
			Запрос.Заголовки,
			500,
			ИмяСобытияДляЖурналаРегистрации,
			НСтр("ru='Использование коллтрекинга отключено в настройках'"));
	КонецЕсли;
	
	ОператорКоллтрекинга = Константы.сфпОператорКоллтрекинга.Получить();
	Если ОператорКоллтрекинга <> Перечисления.CRM_CallTrakingСценарии.Mango Тогда
		Возврат СообщениеОбОшибке(
			Запрос.Заголовки,
			400,
			ИмяСобытияДляЖурналаРегистрации,
			НСтр("ru='Выбран другой оператор коллтрекинга'"));
	КонецЕсли;

	Попытка
		callId = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "callId");				// ID звонка
		uid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "uid");						// Уникальный идентификатор клиента MANGO OFFICE
		yaCid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "yaCid");					// Идентификатор клиента Яндекс Метрики
		gaCid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "gaCid");					// Идентификатор клиента Google Analytics
		rsCid = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "rsCid");					// Идентификатор сеанса (визита), используемый в Roistat
		dateStart = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "dateStart");			// Время поступления звонка
		callType = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "callType");			// Тип звонка
		number = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "number");				// Номер, на который был принят звонок
		callerNumber = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "callerNumber");	// Номер звонившего
		utmSource = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmSource");			// Источник
		utmMedium = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmMedium");			// Канал
		utmCampaign = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmCampaign");		// Кампания
		utmContent = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmContent");		// Содержание объявления
		utmTerm = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "utmTerm");				// Ключевое слово
		countryCode = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "countryCode");		// Код ISO страны
		regionCode = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "regionCode");		// Код ISO региона
		city = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "city");					// Название города
		device = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "device");				// Тип устройства: desktop, tablet или mobile
		ip = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "ip");						// IP адрес пользователя
		url = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "url");						// Адрес страницы сайта, с которой был совершён звонок
		firstUrl = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "firstUrl");			// Адрес страницы входа пользователя на сайт
		customParam = ПолучитьПараметрЗапроса(Запрос.ПараметрыЗапроса, "customParam");		// Дополнительные параметры (не более 4000 символов)
		
		МетрикаUTM_Source = ПолучитьСвойствоМетрики("CRM_Метрика_UTM_Source", "utm_source", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
		МетрикаUTM_Medium = ПолучитьСвойствоМетрики("CRM_Метрика_UTM_Medium", "utm_medium", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
		МетрикаUTM_Campaign = ПолучитьСвойствоМетрики("CRM_Метрика_UTM_Campaign", "utm_campaign", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)));
				
		ДопРеквизиты = Новый Соответствие();
		ДопРеквизиты.Вставить(МетрикаUTM_Source, utmSource);
		ДопРеквизиты.Вставить(МетрикаUTM_Medium, utmMedium);
		ДопРеквизиты.Вставить(МетрикаUTM_Campaign, utmCampaign);
		
		УстановитьПривилегированныйРежим(Истина);
		
		СайтДомен = СтрЗаменить(СтрЗаменить(url, "http://", ""), "https://", "");
		Позиция = Найти(СайтДомен, "/");
		Если Позиция > 0 Тогда
			СайтДомен = Лев(СайтДомен, Позиция - 1);
		КонецЕсли;
		Позиция = Найти(СайтДомен, ":");
		Если Позиция > 0 Тогда
			СайтДомен = Лев(СайтДомен, Позиция - 1);
		КонецЕсли;
		СтруктураСайт = Новый Структура("id,Наименование,domain", "", СайтДомен, СайтДомен);
		Сайт = CRM_СистемаСквознойАналитикиВызовСервера.ЗаписатьИнформациюПоСайтам(СтруктураСайт);
		
		КаналПервичногоИнтереса = "";
		ИсточникПервичногоИнтереса = "";
		
		Если ЗначениеЗаполнено(utmCampaign) Тогда
			КаналПервичногоИнтереса = ОпределитьКаналРекламы(utmMedium, utmSource);
			
			ИсточникПервичногоИнтереса = Справочники.МаркетинговыеМероприятия.НайтиПоРеквизиту("CRM_UTMМетка", utmCampaign);
			Если ИсточникПервичногоИнтереса.Пустая() Тогда
				ТекОбъект = Справочники.МаркетинговыеМероприятия.СоздатьЭлемент();
				ТекОбъект.CRM_UTMМетка = utmCampaign;
				ТекОбъект.Наименование = utmCampaign;
				ТекОбъект.CRM_СквознаяАналитика = Истина;
				ТекОбъект.CRM_Неограниченно = Истина;
				ТекОбъект.Записать();
				
				ИсточникПервичногоИнтереса = ТекОбъект.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		ДатаЗвонка = ТекущаяДата();
		НомерТелефона = Прав(callerNumber, 10);
		
		МенеджерЗаписи = РегистрыСведений.сфпДанныеКоллтрекинга.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.НомерТелефона 			  = НомерТелефона;
		МенеджерЗаписи.ДатаЗвонка 				  = ДатаЗвонка;
		МенеджерЗаписи.Идентификатор 			  = "";
		МенеджерЗаписи.Сайт 					  = url;
		МенеджерЗаписи.utm_campaign				  = utmCampaign;
		МенеджерЗаписи.utm_term		 			  = "";
		МенеджерЗаписи.Оператор 				  = Перечисления.CRM_CallTrakingСценарии.Mango;
		МенеджерЗаписи.Заявка 					  = "";
		МенеджерЗаписи.КаналПервичногоИнтереса 	  = КаналПервичногоИнтереса;
		МенеджерЗаписи.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
		МенеджерЗаписи.Данные					  = ТекстОписание;
		МенеджерЗаписи.Записать();
		
		ИсточникПолучения = "";
		Ответственный = "";
		CRM_РольОтветственного = "";
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ Ссылка, CRM_РольОтветственного, ОтветственныйМенеджер
		|ИЗ Справочник.CRM_ИсточникиПолученияЛидов
		|ГДЕ НЕ ПометкаУдаления И Включено И Сценарий = &Сценарий");
		Запрос.УстановитьПараметр("Сценарий", Перечисления.CRM_CallTrakingСценарии.Mango);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ИсточникПолучения = Выборка.Ссылка;
			Ответственный = Выборка.ОтветственныйМенеджер;
			CRM_РольОтветственного = Выборка.CRM_РольОтветственного;
		КонецЕсли;
		
		Тема = НСтр("ru='Звонок с номера'; en='Call From Number'") + " " + НомерТелефона;
		
		ДокументОбъект = Документы.CRM_Заявка.СоздатьДокумент();
		ДокументОбъект.Дата = ДатаЗвонка;
		ДокументОбъект.Наименование = "";
		ДокументОбъект.Телефон = НомерТелефона;
		ДокументОбъект.ЭлектроннаяПочта = "";
		ДокументОбъект.Тема = Тема;
		ДокументОбъект.ИсточникПолучения = ИсточникПолучения;
		ДокументОбъект.Ответственный = Ответственный;
		ДокументОбъект.CRM_РольОтветственного = CRM_РольОтветственного;
		ДокументОбъект.КаналПервичногоИнтереса = КаналПервичногоИнтереса;
		ДокументОбъект.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
		ДокументОбъект.ТипЗаявки = 1;
		ДокументОбъект.Комментарий = ТекстОписание;
		
		// Запишем доп. реквизиты в Заявку
		Для Каждого ДопРеквизит Из ДопРеквизиты Цикл
			СтрокаСвойств = ДокументОбъект.ДополнительныеРеквизиты.Добавить();
			СтрокаСвойств.Свойство = ДопРеквизит.Ключ;
			СтрокаСвойств.Значение = ДопРеквизит.Значение;
		КонецЦикла;
		
		Документы.CRM_Заявка.ЗаполнитьКонтактЗаявки(ДокументОбъект);
		Справочники.CRM_ПравилаОбработкиОбращений.ПрименитьПравило(ДокументОбъект);
		
		ДокументОбъект.Записать();
						
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("CRM_Сайт", Сайт);
		СтруктураДанных.Вставить("CRM_UTM_source", utmSource);
		СтруктураДанных.Вставить("CRM_UTM_medium", utmMedium);
		СтруктураДанных.Вставить("CRM_UTM_pos", "");
		СтруктураДанных.Вставить("КаналПервичногоИнтереса", КаналПервичногоИнтереса);
		СтруктураДанных.Вставить("ИсточникПервичногоИнтереса", ИсточникПервичногоИнтереса);
		СтруктураДанных.Вставить("ИсточникПолучения", ИсточникПолучения);
		CRM_СистемаСквознойАналитики.УстановитьСсылкуВИсточникПервичногоИнтересаЗаписатьДопРеквизит(ДокументОбъект.Ссылка, СтруктураДанных);
		
		Справочники.CRM_ПравилаОбработкиОбращений.ОбработатьОбращение(ДокументОбъект);
		
		// Удалим записи старше 1 часа.
		Запрос = Новый Запрос("
		|ВЫБРАТЬ НомерТелефона
		|ИЗ РегистрСведений.сфпДанныеКоллтрекинга
		|ГДЕ ДатаЗвонка < &ДатаПроверки");
		Запрос.УстановитьПараметр("ДатаПроверки", (ТекущаяДата() - 3600));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.сфпДанныеКоллтрекинга.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.НомерТелефона = Выборка.НомерТелефона;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		КонецЦикла;

	Исключение
		Возврат СообщениеОбОшибке(
			Запрос.Заголовки,
			500,
			ИмяСобытияДляЖурналаРегистрации,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;

КонецФункции

Функция ПолучитьПараметрЗапроса(ПараметрыЗапроса, ИмяПараметра)
	
	Возврат "" + ПараметрыЗапроса.Получить(ИмяПараметра);
	
КонецФункции	

Функция СообщениеОбОшибке(ЗаголовкиВходящегоЗапроса, КодСостояния, ВложенноеИмяСобытия, Комментарий = Неопределено)
	
	сфпСофтФонПроСерверПереопределяемый.ЗаписатьЗапросВЖурналРегистрации(ВложенноеИмяСобытия, Комментарий, УровеньЖурналаРегистрации.Ошибка);
	Возврат НовыйHTTPСервисОтвет(ЗаголовкиВходящегоЗапроса, КодСостояния);
	
КонецФункции

Функция НовыйHTTPСервисОтвет(ЗаголовкиВходящегоЗапроса, КодСостояния)
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	
	ПодписьКлюч = "Echo";
	ПодписьЗначение = ЗаголовкиВходящегоЗапроса.Получить(ПодписьКлюч);
	Если ПодписьЗначение <> Неопределено Тогда
		Ответ.Заголовки.Вставить(ПодписьКлюч, ПодписьЗначение);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОпределитьКаналРекламы(utmMedium, utmSource)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НРег(utmSource) = "organic" Тогда
		// Бесплатный поиск
		Наименование = "Переходы из поисковых систем";

	ИначеЕсли НРег(utmSource) = "internal" Тогда
		// Внутренние переходы
		Наименование = "Внутренние переходы";
		
	ИначеЕсли НРег(utmSource) = "referral" ИЛИ НРег(utmSource) = "link" Тогда
		// Переходы по ссылкам
		Наименование = "Переходы по ссылкам на сайт";
		
	ИначеЕсли НРег(utmSource) = "direct" ИЛИ НРег(utmSource) = "ya_direct" ИЛИ НРег(utmSource) = "Yandex-Direct" Тогда
		// Прямые заходы
		Наименование = "Прямые заходы";
		
	ИначеЕсли НРег(utmSource) = "email" Тогда
		// Почтовая рассылка
		Наименование = "Переходы с почтовых рассылок";
		
	ИначеЕсли НРег(utmSource) = "cpc" ИЛИ НРег(utmSource) = "ppc" ИЛИ НРег(utmSource) = "paidsearch" ИЛИ НРег(utmSource) = "ad" ИЛИ НРег(utmSource) = "paid" Тогда
		// Поисковая реклама
		Наименование = "Переходы по рекламе";
		
	ИначеЕсли НРег(utmSource) = "social" ИЛИ НРег(utmSource) = "social-network" ИЛИ НРег(utmSource) = "social-media" ИЛИ НРег(utmSource) = "sm" ИЛИ НРег(utmSource) = "social network" ИЛИ НРег(utmSource) = "social media" Тогда
		// Социальные сети
		Наименование = "Переходы из социальных сетей";
		
	ИначеЕсли НРег(utmSource) = "display" ИЛИ НРег(utmSource) = "cpm" ИЛИ НРег(utmSource) = "banner" Тогда
		// Медийная реклама
		Наименование = "Медийная реклама";
		
	ИначеЕсли НРег(utmSource) = "cpv" ИЛИ НРег(utmSource) = "cpa" ИЛИ НРег(utmSource) = "cpp" ИЛИ НРег(utmSource) = "content-text" Тогда
		// Другая реклама
		Наименование = "Прочая реклама";
		
	Иначе
		Наименование = НРег(utmSource);
	КонецЕсли;
	
	Канал = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию(Наименование, Истина);
	Если Канал.Пустая() Тогда
		КаналОбъект = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.СоздатьЭлемент();
		КаналОбъект.Наименование = Наименование;
		КаналОбъект.Записать();
		
		Канал = КаналОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Канал;

КонецФункции

Функция ПолучитьСвойствоМетрики(ИдентификаторМетрики, НаименованиеМетрики, ТипЗначенияМетрики)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Заявка;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка
	|ИЗ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения
	|ГДЕ Имя = &Имя И НЕ ПометкаУдаления И НаборСвойств = &НаборСвойств");
	Запрос.УстановитьПараметр("Имя", ИдентификаторМетрики);
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Имя", ИдентификаторМетрики);
	СтруктураРеквизитов.Вставить("Заголовок", НаименованиеМетрики);
	СтруктураРеквизитов.Вставить("НаборСвойств", НаборСвойств);
	СтруктураРеквизитов.Вставить("ТипЗначения", ТипЗначенияМетрики);
	СтруктураРеквизитов.Вставить("Доступен", Истина);
	СтруктураРеквизитов.Вставить("Виден", Ложь);
	СтруктураРеквизитов.Вставить("ЗаполнятьОбязательно", Ложь);
	
	ОбъектПВХ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектПВХ, СтруктураРеквизитов);
	
	НаименованиеНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектПВХ.НаборСвойств, "Наименование");
	ОбъектПВХ.Наименование = ОбъектПВХ.Заголовок + " (" + НаименованиеНабора + ")";
	ОбъектПВХ.Записать();
	
	Возврат ОбъектПВХ.Ссылка;
	
КонецФункции
